class TestDeletePositive:
    def test_delete_existed_user(self):
        # подготовить пользователя
        # проверить есть ли пользователь, если нет - создать его
        # отправить запрос на удаление пользователя
        # провалидировать ответ
        # проверить, находится ли пользователь после удаления
        pass

    def test_try_to_delete_not_existed_user(self):
        # сгенерировать телефон
        # Проверить, что по такому номеру телефона нет пользователя
        # попробовать удалить пользователя
        # провалидировать ответ
        pass
